# Week 6 Assignment - Pandas

In [1]:
import pandas as pd
import numpy as np

### 1) Load the data into a pandas dataframe (you may get a warning, you can get rid of it by setting low_memory=False). 

### Print the first 10 rows and print a random sampling of the rows in the dataframe.

In [12]:
#Load CSV File Into Dataframe
df = pd.read_csv("data/realtor-data.csv", low_memory=False)

#Print First 10 Rows
print(df.head(10))

#Print Random Sample of Rows
print(df.sample(n=5))

     status  bed bath  acre_lot           city        state  zip_code  \
0  for_sale  3.0  2.0      0.12       Adjuntas  Puerto Rico     601.0
1  for_sale  4.0  2.0      0.08       Adjuntas  Puerto Rico     601.0
2  for_sale  2.0  1.0      0.15     Juana Diaz  Puerto Rico     795.0
3  for_sale  4.0  2.0      0.10          Ponce  Puerto Rico     731.0
4  for_sale  6.0  2.0      0.05       Mayaguez  Puerto Rico     680.0
5  for_sale  4.0  3.0      0.46  San Sebastian  Puerto Rico     612.0
6  for_sale  3.0  1.0      0.20         Ciales  Puerto Rico     639.0
7  for_sale  3.0  2.0      0.08          Ponce  Puerto Rico     731.0
8  for_sale  2.0  1.0      0.09          Ponce  Puerto Rico     730.0
9  for_sale  5.0  3.0      7.46     Las Marias  Puerto Rico     670.0

   house_size prev_sold_date     price
0       920.0            NaN  105000.0
1      1527.0            NaN   80000.0
2       748.0            NaN   67000.0
3      1800.0            NaN  145000.0
4         NaN            NaN   65000.0
5      2520.0            NaN  179000.0
6      2040.0            NaN   50000.0
7      1050.0            NaN   71600.0
8      1092.0            NaN  100000.0
9      5403.0            NaN  300000.0
           status  bed bath  acre_lot            city          state  \
103636   for_sale  3.0  2.0      0.47      Burlington  Massachusetts
979503   for_sale  3.0  4.0      0.16       Ridgewood     New Jersey
1051443  for_sale  NaN  NaN      1.20  Hewlett Harbor       New York
1235371  for_sale  NaN  NaN     12.60  Hunter Village       New York
1041813  for_sale  1.0  1.0       NaN          Queens       New York

         zip_code  house_size prev_sold_date      price
103636     1803.0      1911.0     1992-05-29   724900.0
979503     7450.0         NaN     2017-11-15   900000.0
1051443   11557.0         NaN     2022-03-01  1199999.0
1235371   12442.0         NaN            NaN   449000.0
1041813   11372.0         NaN            NaN   475000.0

### 2) You should always check how many null values there are in your data as well as the data types of the data you're working with. Often you will come across data that looks correct but isn't the right data type. 

### Check the number of null values for every column and check the data types as well

In [3]:
#Check and Print For Null Values
null_counts = df.isnull().sum()
print("Null Counts:")
print(null_counts[null_counts > 0])

#Check and Print Data Types
data_types = df.dtypes
data_type_counts = df.dtypes.value_counts()
print("Data Type Counts:")
print(data_type_counts)

Null Counts:
bed               216467
bath              194206
acre_lot          357467
city                 191
zip_code             479
house_size        450112
prev_sold_date    686293
price                108
dtype: int64
Data Type Counts:
object     7
float64    3
Name: count, dtype: int64

### 3) We have 3 columns that looked right when checking the data but aren't the right data type and we'll correct it. 

### Cast the columns bed, bath and price to float. Values that cannot be casted to float, like "hello" should be turned into NaN. 

### Check the data types again to make sure the conversion was successfull.



### Get a count of the number of NaNs in bed, bath and price columns. 

### You should get 216535, 194215 and 110 respectively

In [4]:
#Cast Bed, Bath, and Price to Floats - Or As NaN
df['bed'] = pd.to_numeric(df['bed'], errors='coerce')
df['bath'] = pd.to_numeric(df['bath'], errors='coerce')
df['price'] = pd.to_numeric(df['price'], errors='coerce')

#Check and Print Data Types Again
print("New Data Types:")
print(df[['bed', 'bath', 'price']].dtypes)

#Count and Print NaNs in Bed, Bath, and Price
nan_counts = df[['bed', 'bath', 'price']].isnull().sum()
print("NaN Counts:")
print(nan_counts)

New Data Types:
bed      float64
bath     float64
price    float64
dtype: object
NaN Counts:
bed      216535
bath     194215
price       110
dtype: int64

### 4) Check the number of unique values in the bed, bath and state columns. 

### You should get 49, 42 and 19 respectively

### Print the uniques values for bed, bath and state. What do you notice about the unique values ?

In [5]:
#Check and Print the Number of Unique Values in Bed, Bath, and State
unique_counts = df[['bed', 'bath', 'state']].nunique()
print("Unique values:")

print(unique_counts)
print("\nUnique values in 'Bedrooms':", df['bed'].unique())
print("\nUnique values in 'Bathrooms':", df['bath'].unique())
print("\nUnique values in 'States':", df['state'].unique())

#What do you notice about the unique values?

Unique values:
bed      49
bath     42
state    19
dtype: int64

Unique values in 'Bedrooms': [  3.   4.   2.   6.   5.   1.   9.  nan   7.   8.  12.  13.  10.  11.
  33.  24.  28.  14.  18.  20.  16.  15.  19.  17.  40.  21.  86.  31.
  27.  42.  60.  22.  32.  99.  49.  29.  30.  23.  46.  36.  68. 123.
  25.  47.  inf  35.  38.  64.  48.  75.]

Unique values in 'Bathrooms': [  2.   1.   3.   5.   4.   7.   6.  nan   8.   9.  10.  12.  13.  35.
  11.  16.  15.  18.  20.  14.  36.  25.  17.  19.  56.  42.  51.  28.
 198.  22.  33.  27.  30.  29.  24.  46.  21. 123.  39.  43.  32.  45.
  64.]

Unique values in 'States': ['Puerto Rico' 'Virgin Islands' 'Massachusetts' 'Connecticut'
 'New Hampshire' 'Vermont' 'New Jersey' 'New York' 'South Carolina'
 'Tennessee' 'Rhode Island' 'Virginia' 'Wyoming' 'Maine' 'Georgia'
 'Pennsylvania' 'West Virginia' 'Delaware' 'Louisiana']

### 5) We want to see which state has the largest number of properties for sale. 

### Print a count of the number of properties in each state/territory. 

### We want to make sure that we're getting unique listings, so drop any duplicate rows and print the count of the number of properties. What do you notice about the number of properties in each state ?

In [6]:
#Drop Duplicate Rows for Unique Listings
df_unique = df.drop_duplicates()

#Count and Print of Number of Properties in Each State/Territory
state_counts = df_unique['state'].value_counts()
print("Number of Properties in Each State/Territory:")
print(state_counts)

Number of Properties in Each State/Territory:
state
New York          67160
New Jersey        32601
Connecticut       13753
Massachusetts     10056
Pennsylvania       9549
Maine              4938
New Hampshire      3431
Rhode Island       3332
Puerto Rico        2651
Vermont            2544
Delaware           1290
Virgin Islands      730
Virginia              7
Georgia               5
West Virginia         1
Tennessee             1
Wyoming               1
South Carolina        1
Louisiana             1
Name: count, dtype: int64

### 6) We now want to look for patterns in our data, find the 5 dates when the most houses were sold. What do you notice ?

In [ ]:
#Sanitize Date Sold Column Data
df['prev_sold_date'] = pd.to_datetime(df['prev_sold_date'], errors='coerce')

#Count Sales By Date and Find Top 5 Dates
sales_by_date = df_unique['prev_sold_date'].value_counts()
top_5_dates = sales_by_date.head(5)
print("Top 5 Dates For Mosy Houses Sold:")
print(top_5_dates)

#What do you notice?

Top 5 Dates For Mosy Houses Sold:

prev_sold_date
2022-04-15    68
2022-04-29    58
2022-03-31    57
2022-04-01    54
2022-02-28    54
Name: count, dtype: int64

### 7) Now we want to create a simple but effective summary of the properties that are for sale. 

### Let's create a summary table that contains the average home size and price, every state and each city within a state.

In [10]:
#Sanitize the Data for Price and Home Size
df['price'] = pd.to_numeric(df['price'], errors='coerce')
df['home_size'] = pd.to_numeric(df['house_size'], errors='coerce')

#Summary of Properties For Sale
summary_table = df_unique.groupby(['state', 'city']).agg(
    avg_home_size=('house_size', 'mean'),
    avg_price=('price', 'mean')
).reset_index()

#Printed Table
summary_table


#Your output should be this:
# 		                          house_size	price
# state	            city		
# Connecticut	    Andover	     1653.750000	2.539500e+05
#                   Ansonia	     1848.172414	2.917902e+05
#                   Ashford	     1638.888889	1.959045e+05
#                   Avon	     2929.878788	5.824611e+05
#                   Barkhamsted	 2703.538462	3.383238e+05
# ...	...	...	...
# Virgin Islands	Saint Thomas 3435.025641	1.185128e+06
# Virginia	        Cape Charles	     NaN	7.130000e+05
#                   Chincoteague	     NaN	1.620000e+05
# West Virginia	    Wyoming	     1860.000000	6.250000e+04
# Wyoming	        Cody	     1935.000000	5.350000e+05

               state          city  avg_home_size     avg_price
0        Connecticut       Andover    1653.750000  2.539500e+05
1        Connecticut       Ansonia    1848.172414  2.917902e+05
2        Connecticut       Ashford    1638.888889  1.959045e+05
3        Connecticut          Avon    2929.878788  5.824611e+05
4        Connecticut   Barkhamsted    2703.538462  3.383238e+05
...              ...           ...            ...           ...
4303  Virgin Islands  Saint Thomas    3435.025641  1.185128e+06
4304        Virginia  Cape Charles            NaN  7.130000e+05
4305        Virginia  Chincoteague            NaN  1.620000e+05
4306   West Virginia       Wyoming    1860.000000  6.250000e+04
4307         Wyoming          Cody    1935.000000  5.350000e+05

[4308 rows x 4 columns]